# Analyzing Data with Pandas 
Here, we continue our exploration of the Pandas package. We focus on various ways data stored in dataframes can be analyzed using the package. Specifically, we look at: 
1. [Calculating and updating fields](#1.-Calculating-and-updating-fields)
* [Selecting data in a dataframe](#2.-Selecting-data-from-a-dataframe)
 1. [Selecting single rows, select rows, or row slices using `iloc`](#2a.-Selecting-single-rows,-select-rows,-or-row-slices-using-iloc)
 1. [Selecting rows and columns using `iloc`](#2b.-Selecting-rows-and-columns-using--iloc)
 1. [Selecting rows and columns using `loc`](#2c.-Selecting-rows-and-columns-using--loc)
 1. [Selecting rows based on criteria - using _queries_](#2d.-Selecting-rows-based-on-criteria---using-queries)
 1. [Selecting rows based on criteria - using _masks_](#2e.-Selecting-rows-based-on-criteria---using-masks)
 1. [Updating values in selected rows/columns](#2f.-Updating-values-in-selected-rows/columns)
* [Grouping and aggregating data in a dataframe](#3.-Grouping-data)

In [1]:
#Import data
import pandas as pd

In [2]:
#Initial import of surveys dataset
survey_df = pd.read_csv('../data/surveys.csv',
                        index_col='record_id',
                        dtype={'plot_id':'str'})
survey_df.head()

           month  day  year plot_id species_id sex  hindfoot_length  weight
record_id
1              7   16  1977       2         NL   M             32.0     NaN
2              7   16  1977       3         NL   M             33.0     NaN
3              7   16  1977       2         DM   F             37.0     NaN
4              7   16  1977       7         DM   M             36.0     NaN
5              7   16  1977       3         DM   M             35.0     NaN

## 1. Calculating and updating fields
A typical operation in dataframes is creating new fields from values in other fields. We'll show this by computing hindfoodt_length (currently in mm) into inches. (25.4 mm per inch...)

In [3]:
#Create a field of hindfoot length in inches
survey_df['hindfoot_length_in'] = survey_df['hindfoot_length'] / 25.4

#Review the output
survey_df.head()

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in
record_id,,,,,,,,,
1,7,16,1977,2,NL,M,32.0,NaN,1.259843
2,7,16,1977,3,NL,M,33.0,NaN,1.299213
3,7,16,1977,2,DM,F,37.0,NaN,1.456693
4,7,16,1977,7,DM,M,36.0,NaN,1.417323
5,7,16,1977,3,DM,M,35.0,NaN,1.377953

► YOU TRY IT:
* Create a new column "weight_oz" converting weigth (grams) into ounces (28.35 g/oz)

In [5]:
#Create a field of weight in ounces
survey_df['weight_oz'] = survey_df['weight'] * 28.35

#Review the output
survey_df.tail()

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz
record_id,,,,,,,,,,
35545,12,31,2002,15,AH,NaN,NaN,NaN,NaN,NaN
35546,12,31,2002,15,AH,NaN,NaN,NaN,NaN,NaN
35547,12,31,2002,10,RM,F,15.0,14.0,0.590551,396.90
35548,12,31,2002,7,DO,M,36.0,51.0,1.417323,1445.85
35549,12,31,2002,5,NaN,NaN,NaN,NaN,NaN,NaN

## 2. Selecting data from a dataframe
We often want to isolate specific rows and/or columns of data from our dataframe for further analysis. Pandas offers many ways to do this. Here we'll review these techniques. 

### 2a. Selecting single rows, select rows, or row *slices* using `iloc`
Recall that dataframes can be considered lists (rows) of lists (columns). As such, we can select specific rows by their **integer index**, either indivdually or in *slices*. This is done using the dataframe's `iloc` method.

Refer to the [Pandas help on `iloc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html) for more info on this functionality: 
> _**`iloc`** is short for integer location_

In [7]:
#Fetch the 4th row of data
survey_df.iloc[3]

month                        7
day                         16
year                      1977
plot_id                      7
species_id                  DM
sex                          M
hindfoot_length           36.0
weight                     NaN
hindfoot_length_in    1.417323
weight_oz                  NaN
Name: 4, dtype: object

In [8]:
#Fetch the 101st thru 110th rows of data
survey_df.iloc[100:110]

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz
record_id,,,,,,,,,,
101,8,20,1977,5,DM,F,35.0,46.0,1.377953,1304.10
102,8,20,1977,23,DM,F,35.0,40.0,1.377953,1134.00
103,8,20,1977,18,DM,F,35.0,30.0,1.377953,850.50
104,8,20,1977,11,DS,M,43.0,NaN,1.692913,NaN
105,8,20,1977,19,DM,M,35.0,39.0,1.377953,1105.65
106,8,20,1977,12,NL,NaN,NaN,NaN,NaN,NaN
107,8,20,1977,18,NL,NaN,NaN,NaN,NaN,NaN
108,8,20,1977,11,PP,M,21.0,NaN,0.826772,NaN
109,8,20,1977,6,DM,M,35.0,34.0,1.377953,963.90
110,8,20,1977,10,DS,NaN,NaN,NaN,NaN,NaN

In [12]:
#Fetch the 3rd, 5th, and 10th rows
survey_df.iloc[[2,4,9, -1],2]

record_id
3        1977
5        1977
10       1977
35549    2002
Name: year, dtype: int64

### 2b. Selecting rows and columns using  `iloc` 
The `iloc` method can also be used to select columns. Which columns to select are passed as the second parameter in the `iloc` function. Therefore, we need to specify which rows we want to fetch first. If we want to retrieve the selected columns for all rows, we can just pass a "`:`" as the first parameter.

In [11]:
#Select all rows and the 4th column of the dataset
survey_df.iloc[:,3]

record_id
1         2
2         3
3         2
4         7
5         3
         ..
35545    15
35546    15
35547    10
35548     7
35549     5
Name: plot_id, Length: 35549, dtype: object

In [14]:
#Select the first 5 rows and the 4th column of the dataset
survey_df.iloc[:5,3:6]

          plot_id species_id sex
record_id
1               2         NL   M
2               3         NL   M
3               2         DM   F
4               7         DM   M
5               3         DM   M

→ ***So you see, selecting subsets is just a matter of messing around with the row/column integer indices and inserting them into the `iloc` method.***

### 2c. Selecting rows and columns using  `loc` 
While `iloc` selects rows and columns by their absolute _position_, `loc` selects rows and columns by their _labels_. Yes, each row and column has a label. A column's label is its ***column name***; a row's label is its ***label index*** (not to be confused with its _integer_ index, which is simply its row number).

When Pandas reads in a CSV file, the CSV file determines the column names, but row labels are assigned a sequential numeric value by default. When we read in data into our `surveys_df`, we specified the values inthe `record_id` column to become our index, i.e., our row labels. We can now use these labels to select rows, and combine them with column names to select row/column combinations:

In [15]:
#Fetch the row with row label of 10
survey_df.loc[10]

month                        7
day                         16
year                      1977
plot_id                      6
species_id                  PF
sex                          F
hindfoot_length           20.0
weight                     NaN
hindfoot_length_in    0.787402
weight_oz                  NaN
Name: 10, dtype: object

In [16]:
#Fetch value in the species_id column in the row with row label of 10 
survey_df.loc[10,'species_id']

'PF'

Because our dataframe's row index (i.e. its row labels) happens to be numeric, we can fetch slices of values. We can also fetch multiple columns by passing them in as a list.

In [17]:
#Fetch value in the species_id column in the row with rows with labels between 10 and 20
survey_df.loc[10:20,['species_id','sex']]

          species_id  sex
record_id
10                PF    F
11                DS    F
12                DM    M
13                DM    M
14                DM  NaN
15                DM    F
16                DM    F
17                DS    F
18                PP    M
19                PF  NaN
20                DS    F

### 2d. Selecting rows based on criteria - using _queries_
Instead of selecting data by position or by index, we can also query our dataframe for all records meeting specific criteria. In this first example, we'll use the dataframe's `query()` function.

In [18]:
#Fetch all records from the year 1997 into a new variable
records_1997 = survey_df.query('year == 1997')
records_1997.shape

(2493, 10)

In [20]:
#Fetch all records from 1997 for female individuals
females_1997 = survey_df.query('year == 1997 | sex == "F"')
females_1997.shape

(17112, 10)

### 2e. Selecting rows based on criteria - using _masks_
Queries are handy, but as more criteria are used, the query statement can get cumbersome. The use of masks provide a somewhat more simplified approach, or at least a more modular approach. 

A "mask" is a Python series (i.e. one column of data) with a Boolean values for each row:

In [22]:
survey_df.query('hindfoot_length < 35')

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz
record_id,,,,,,,,,,
1,7,16,1977,2,NL,M,32.0,NaN,1.259843,NaN
2,7,16,1977,3,NL,M,33.0,NaN,1.299213,NaN
6,7,16,1977,1,PF,M,14.0,NaN,0.551181,NaN
9,7,16,1977,1,DM,F,34.0,NaN,1.338583,NaN
10,7,16,1977,6,PF,F,20.0,NaN,0.787402,NaN
...,...,...,...,...,...,...,...,...,...,...
35540,12,31,2002,15,PB,F,26.0,23.0,1.023622,652.05
35541,12,31,2002,15,PB,F,24.0,31.0,0.944882,878.85
35542,12,31,2002,15,PB,F,26.0,29.0,1.023622,822.15
35543,12,31,2002,15,PB,F,27.0,34.0,1.062992,963.90
35547,12,31,2002,10,RM,F,15.0,14.0,0.590551,396.90

In [23]:
#Create a mask for all records with hindfeet smaller than 35mm
mask_smallfeet = survey_df['hindfoot_length'] < 35
mask_smallfeet

record_id
1         True
2         True
3        False
4        False
5        False
         ...
35545    False
35546    False
35547     True
35548    False
35549    False
Name: hindfoot_length, Length: 35549, dtype: bool

We can now apply this mask to select records where the mask value is true by using it with the `loc` method.

In [26]:
survey_df.loc[mask_smallfeet]

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz
record_id,,,,,,,,,,
1,7,16,1977,2,NL,M,32.0,NaN,1.259843,NaN
2,7,16,1977,3,NL,M,33.0,NaN,1.299213,NaN
6,7,16,1977,1,PF,M,14.0,NaN,0.551181,NaN
9,7,16,1977,1,DM,F,34.0,NaN,1.338583,NaN
10,7,16,1977,6,PF,F,20.0,NaN,0.787402,NaN
...,...,...,...,...,...,...,...,...,...,...
35540,12,31,2002,15,PB,F,26.0,23.0,1.023622,652.05
35541,12,31,2002,15,PB,F,24.0,31.0,0.944882,878.85
35542,12,31,2002,15,PB,F,26.0,29.0,1.023622,822.15
35543,12,31,2002,15,PB,F,27.0,34.0,1.062992,963.90
35547,12,31,2002,10,RM,F,15.0,14.0,0.590551,396.90

What's nice about masks is that we can combine multiple masks. Think of each Boolean value as as on/off switch that determines whether or not the value is added to the final set. We use `&` ["and" switch] to combine switches such that each must be "on", and `|` ["or" switch] to require only one switch to be on.

In [27]:
#Create a mask of females
mask_male = survey_df['sex'] == 'M'
mask_male

#Create a mask for records colected in April
mask_april = survey_df['month'] == 4

In [28]:
#Filter records meeting all criteria
data_subset = survey_df.loc[mask_smallfeet & mask_male & mask_april]
data_subset.shape

(790, 10)

In [29]:
#Filter records meeting any criteria
data_subset = survey_df.loc[mask_smallfeet | mask_male | mask_april]
data_subset.shape

(27550, 10)

#### ►Knowledge check:
* Use the `query()` function to select all male individuals with weight greater than 41 g. 
 * What is the median hindfoot length of this population? 
* Perform the same analysis using masks.

In [30]:
#Extract males weighing more than 41 g - using query
subset = survey_df.query("sex == 'M' and weight > 41")
subset['hindfoot_length'].median()

36.0

In [31]:
#Extract males weighing more than 41 g - using masks
mask_weight = survey_df['weight'] > 41
subset_2 = survey_df.loc[mask_male & mask_weight]
subset_2['hindfoot_length'].median()

36.0

### 2f. Updating values in selected rows/columns
We've learned how to select data in specific rows and columns. Now we'll update those values.

Our dataset has some erroneous data: records occuring on the "31st" day of April (which has only 30 days in it). We'll replace those dates to be the 30th day of April. To do this, we have to select rows where the month is '4' and the day is '31'. And then with those rows selected, we'll update the the values in the day column to be 30.

In [33]:
#Create masks for day = 31 and month = 4
mask_day = survey_df['day'] == 31
mask_april = survey_df['month'] == 4 
mask_sept = survey_df['month'] == 9

If we apply the masks, it returns a dataframe of that selection

In [34]:
#Apply the masks
survey_df.loc[mask_day & (mask_april | mask_sept)]

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz
record_id,,,,,,,,,,
30650,4,31,2000,6,PP,F,22.0,19.0,0.866142,538.65
30651,4,31,2000,6,PB,M,25.0,32.0,0.984252,907.20
30652,4,31,2000,6,PB,F,25.0,30.0,0.984252,850.50
30653,4,31,2000,6,PP,M,23.0,20.0,0.905512,567.00
30654,4,31,2000,6,PP,M,23.0,24.0,0.905512,680.40
...,...,...,...,...,...,...,...,...,...,...
31500,9,31,2000,16,PM,M,17.0,11.0,0.669291,311.85
31501,9,31,2000,16,OT,F,20.0,NaN,0.787402,NaN
31502,9,31,2000,5,NaN,NaN,NaN,NaN,NaN,NaN
31503,9,31,2000,7,NaN,NaN,NaN,NaN,NaN,NaN
31504,9,31,2000,10,NaN,NaN,NaN,NaN,NaN,NaN

We can add a column designation to just get one column with the selected rows:

In [35]:
#Fetch the just the day column of the filtered rows
survey_df.loc[mask_day & (mask_april | mask_sept), 'day']

record_id
30650    31
30651    31
30652    31
30653    31
30654    31
         ..
31500    31
31501    31
31502    31
31503    31
31504    31
Name: day, Length: 136, dtype: int64

Rather than just display to the screen, we can assign and new value to this selection

In [36]:
#Update the values
survey_df.loc[mask_day & (mask_april | mask_sept), 'day'] = 30

Check our results...

In [37]:
#What's the largest value in the day column for records where month = 4
survey_df.query('month == 4 or month == 9')['day'].max()

30

With the dates fixed, we can now create a date attribute

In [38]:
survey_df['date'] = pd.to_datetime(survey_df[['year','month','day']])
survey_df.head()

,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,hindfoot_length_in,weight_oz,date
record_id,,,,,,,,,,,
1,7,16,1977,2,NL,M,32.0,NaN,1.259843,NaN,1977-07-16
2,7,16,1977,3,NL,M,33.0,NaN,1.299213,NaN,1977-07-16
3,7,16,1977,2,DM,F,37.0,NaN,1.456693,NaN,1977-07-16
4,7,16,1977,7,DM,M,36.0,NaN,1.417323,NaN,1977-07-16
5,7,16,1977,3,DM,M,35.0,NaN,1.377953,NaN,1977-07-16

## 3. Grouping data
We often want to calculate summary statistics grouped by subsets or attributes within fields of our data. For example, we might want to calculate the average weight of all individuals per some variable like `species_id`, `plot_id` or `sex`. This is done by Pandas' `group_by()` function. 

So let's go through the process of grouping data by sex (a variable without a lot of unique values) and computing mean weight and mean hindfoot length of males vs females.

First, some review:
* We can calculate summary statistics for **all** records in a single column using the syntax below:

In [39]:
survey_df['weight'].describe()

count    32283.000000
mean        42.672428
std         36.631259
min          4.000000
25%         20.000000
50%         37.000000
75%         48.000000
max        280.000000
Name: weight, dtype: float64

* We can also extract each single metric separately if we wish:

In [40]:
print(" Min: ", survey_df['weight'].min())
print(" Max: ", survey_df['weight'].max())
print(" Mean: ", survey_df['weight'].mean())
print(" Std Dev: ", survey_df['weight'].std())
print(" Count: ", survey_df['weight'].count())

 Min:  4.0
 Max:  280.0
 Mean:  42.672428212991356
 Std Dev:  36.63125947458358
 Count:  32283

* To summarize by a categorical value, we group the data on that variable. The result of this operation is a new type of object - a Pandas "DataFrameGroupBy" object, which is an intermediate to doing analysis on grouped data.

In [41]:
#Group the data by unique values in the `sex` field
grouped_data = survey_df.groupby('sex')

#This creates a Panda's "grouped dataframe" object
type(grouped_data)

pandas.core.groupby.generic.DataFrameGroupBy

* To analyze the grouped dataframe object, we supply an aggregate function like `min()`, `median()`, `count()` etc.

In [42]:
#Compute the median value of all numeric fields for each group
grouped_data.median()

,month,day,year,hindfoot_length,weight,hindfoot_length_in,weight_oz
sex,,,,,,,
F,7.0,16.0,1990.0,27.0,34.0,1.062992,963.90
M,6.0,16.0,1990.0,34.0,39.0,1.338583,1105.65

In [43]:
# Provide a list of fields if you want to restrict what columns are reported
grouped_data[['hindfoot_length','weight']].median()

     hindfoot_length  weight
sex
F               27.0    34.0
M               34.0    39.0

In [44]:
# Or, use the describe function to reveal all summary stats for the grouped data
grouped_data['weight'].describe()

       count       mean        std  min   25%   50%   75%    max
sex
F    15303.0  42.170555  36.847958  4.0  20.0  34.0  46.0  274.0
M    16879.0  42.995379  36.184981  4.0  20.0  39.0  49.0  280.0

---
### <font color='red'>Challenge - Summary Data </font>
1. How many recorded individuals are female `F` and how many male `M`

In [49]:
# Challenge 1: Show the *count* of records, grouped by sex
grouped_data.count()

,month,day,year,plot_id,species_id,hindfoot_length,weight,hindfoot_length_in,weight_oz,date
sex,,,,,,,,,,
F,15690,15690,15690,15690,15690,14894,15303,14894,15303,15690
M,17348,17348,17348,17348,17348,16476,16879,16476,16879,17348

2. The statement above produces another dataframe. Show just the count of the records in the `weight` field in the resulting dataframe.

In [ ]:
# Challege 2: Just show the 'month' column in the above statement
#grouped_data.█()['█']

3. What happens when you group by two columns using the following syntax and then grab mean values:
 * `grouped_data2 = survey_df.groupby(['plot_id','sex'])`
 * `grouped_data2.mean()`

In [ ]:
# Challenge 3

4. Display summary statistics of **hindfood length** values for each **plot id** in your data.  
_HINT: First group data, then extract the one variable you want to summarize, and finally use the `describe` function on that result to compute summary statistics..._

In [ ]:
# Challenge 4

### *More complex aggregating functions...*
We can also supply a **dictionary of aggregating functions** so that each column in the grouped result is aggregated exactly how we want (i.e. instead of computing just the sum or mean of all columns). This dictionary is built by specifying the <u>column name as the key</u> and the <u>aggregate function(s) as the values</u>. Below is an example to aggregate the data by `sex`, computing the minumum and maximum of the `year`, the median of the `hindfoot_length`, and the mean `weight`.

In [ ]:
#Create the aggregate function dictionary
aggFuncs = {
    "year": ['count','min','max'],#compute count, min, and max of the year attribute
    "hindfoot_length": 'median',  #compute the median hindfoot length
    "weight": 'mean'}             #compute the mean weight
#Apply the dictionary
survey_df.groupby('sex').agg(aggFuncs)

## 4. Transforming data with pivot tables
And finally, we can transform our data via pivot tables. In this operation, we take two categorical values in our data set, creating row labels with one and column names with the other.

In [ ]:
survey_df.pivot_table(
    values = 'weight',
    index = 'species_id',
    columns= 'year',
    aggfunc ='mean'
).fillna(-1).T.style.background_gradient(cmap = 'YlGnBu')